{
  "Virtus": {
    "position": "Full-Stack Engineer",
    "date": "Mar 2023 - Present",
    "workDone": [
      "Migrated customer file storage from local hard drives to Google Cloud, streamlining file management and improving employee productivity by 15%.",
      "Designed and implemented a custom calendar system for scheduling and assigning tasks to installers, inspectors, and supervisors, improving task management efficiency.",
      "Revamped the reporting module to use on-demand report generation, resulting in a 60% improvement in loading times and a better user experience.",
      "Developed interactive SVG-based components for real-time visualization of service call data, enabling intuitive insights for end users.",
      "Built reusable React components using TypeScript and Tailwind, improving code scalability and reducing development time for future features.",
      "Established a robust CI/CD pipeline with CircleCI, reducing manual deployment errors and accelerating release cycles.",
      "Participated in Agile ceremonies, contributing to sprint planning, backlog grooming, and retrospectives to ensure smooth project execution.",
      "Enhanced accessibility by implementing responsive designs and cross-browser compatibility for all features.",
      "Developed comprehensive unit, integration end-to-end tests using RTL, Cypress, Jest and Supertest, achieving 90% test coverage for critical features."
    ],
    "technologies": [
      "JS",
      "TS",
      "React",
      "Redux",
      "Bootstrap",
      "Formik",
      "Next",
      "Tailwind",
      "GCP",
      "Node",
      "Express",
      "Nest",
      "MongoDB",
      "Mocha",
      "Chai",
      "Jest",
      "React Testing Library",
      "Cypress",
      "Digital Ocean"
    ]
  },
  "Cognative": {
    "position": "Frontend Engineer",
    "date": "Sep 2022 - Feb - 2023",
    "workDone": [
      "Led the development of a construction services hailing app that achieved a 15% increase in revenue after its launch.",
      "Designed interactive dashboards using React and D3 to display real-time data, helping users visualize key metrics effectively.",
      "Collaborated with backend teams to create queries for fetching and manipulating data efficiently, ensuring seamless frontend-backend integration.",
      "Utilized TypeScript to enhance type safety across the construction services app, reducing runtime errors by 25% and enhancing developer productivity.",
      "Created GitHub Actions workflows for automated builds and testing, reducing time spent on manual processes by 30%.",
      "Designed and implemented reusable UI components using Tailwind CSS, improving design consistency across the application.",
      "Conducted performance optimizations by lazy-loading React components, React server components and leveraging dynamic imports, reducing initial page load times by 40%.",
      "Participated in Agile ceremonies, contributing to sprint planning, backlog grooming, and retrospectives to ensure smooth project execution.",
      "Created TikZ/PGF visual elements for use in interactive dashboards, showcasing real-time metrics with precision.",
      "Authored user manuals and technical guides using LaTeX, ensuring high-quality and consistent formatting."
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "React Native Elements",
      "Expo",
      "Formik",
      "Socket.io",
      "LaTex"
    ]
  },
  "LUKSolar": {
    "position": "Frontend Engineer",
    "date": "Mar 2022 - Aug - 2022",
    "workDone": [
      "I led the development of an in-house sales management application for solar products which increased Solar Scout productivity by 30%, reduced administrative overhead by 20%, increased operational efficiency and generated more funding for the company.",
      "Worked closely with the design and backend teams to ensure we put up something that would make the users (Solar Scouts) happy and create lasting value for the company."
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "Native Base",
      "Expo",
      "Formik",
      "Socket.io"
    ]
  },
  "HackerBay": {
    "position": "Full-Stack Engineer",
    "date": "May 2020 - Oct - 2022",
    "workDone": [
      "Developed dozens of core features for a Site Reliability Engineering tool, leveraging React, TypeScript, and Node.js for a seamless user experience.",
      "Enhanced image upload functionality by implementing background processing and integrating OpenCV for stitching multiple images into a single file, improving upload performance by 25%.",
      "Created interactive visualizations for performance monitoring dashboards, offering a dynamic and intuitive way to analyze system health.",
      "Refactored backend services to align with TypeScript standards, improving maintainability and reducing debugging time by 30%.",
      "Refactored a React Native codebases to integrate custom native modules for image processing and background tasks, enhancing application performance and stability.",
      "Implemented dynamic form rendering with React and Redux, enabling the app to adapt seamlessly to user input without compromising performance.",
      "Improved system security by reviewing and updating authentication flows, introducing token-based mechanisms for enhanced user protection.",
      "Reduced technical debt by identifying and fixing performance bottlenecks in both frontend and backend systems.",
      "Optimized deployment pipelines using GitHub Actions, automating test, build, and deployment workflows to minimize downtime."
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Redux Form",
      "Bootstrap",
      "Socket.io",
      "Node",
      "Express",
      "Puppeteer",
      "Mocha",
      "Chai",
      "Jest",
      "MongoDB",
      "OpenCV",
      "React Native",
      "Expo"
    ]
  },
  "Andela": {
    "position": "Full-Stack Engineer",
    "date": "Dec 2018 - Dec - 2019",
    "workDone": [
      "Delivered scalable, user-friendly features for Andela's in-house engineer placement platform, streamlining operations and improving engineer-client matching.",
      "Created interactive, data visualizations to showcase key metrics and trends, providing actionable insights to stakeholders.",
      "Collaborated with design teams to build scalable, React-based interfaces for the in-house engineer placement platform.",
      "Participated in the design and development of end-to-end solutions, collaborating closely with cross-functional teams to ensure timely delivery.",
      "Contributed to various bootcamp projects, applying JavaScript, React, Python/Django and PHP/Laravel to create modular and maintainable applications.",
      "Participated in Agile ceremonies, contributing to sprint planning, backlog grooming, and retrospectives to ensure smooth project execution.",
      "Improved platform performance by implementing optimized state management techniques using Redux and React Query.",
      "Integrated external APIs and ensured seamless data handling by leveraging PHP and Laravel in backend development.",
      "Developed testing suites with Cypress, Jest, and PHPUnit, ensuring application reliability and functionality across diverse use cases. "
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "SASS",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "Enzyme",
      "Python",
      "Flask",
      "Django",
      "Postgre SQL"
    ]
  },
  "GoPay": {
    "position": "Full-Stack Engineer",
    "date": "Aug 2017 - Oct - 2018",
    "workDone": [
      "Developed and maintained major features of Go Pay's management dashboard",
      "Implemented and tested the mobile money integration using the inter-switch API. This improved the productivity of the backend team which was not familiar with the mobile money technology"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Bootstrap",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "MySQL"
    ]
  }
}
