{
  "Virtus": {
    "position": "Full-Stack Engineer",
    "date": "Mar 2023 - Present",
    "workDone": [
      "Made significant improvements to in-house CRM such as introducing database transactions (reduced integration test time by over 60%) and keyset pagination which decreased fetching time by 20%, as well as failure retry logic.",
      "Introduced periodic report generation that increated loading time by 40%. Also seperated a single reporting module that would load multiple reports simultaneously into seperating granular reports that increased loading by over 90%",
      "I wrote logic for uploading customer files on Google Cloud which were being store on a local hard drive. This significantly improved operational efficiency and employee productivity by 15%",
      "Also introduced redis caching on routes that were fetching a lot of data, this significantly improved the response time",
      "I&#x2019;m currently working a property management tool that is used to manage construction work on apartment buldings"
    ],
    "technologies": [
      "TS",
      "TS",
      "React",
      "Redux",
      "Bootstrap",
      "Ant Design",
      "Formik",
      "Next",
      "Tailwind",
      "GCP",
      "Node",
      "Express",
      "Nest",
      "MongoDB",
      "Mocha",
      "Chai",
      "Jest",
      "React Testing Library",
      "Digital Ocean"
    ]
  },
  "Cognative": {
    "position": "Frontend Engineer",
    "date": "Sep 2022 - Feb - 2023",
    "workDone": [
      "Led the development of a construction services hailing application that registsred a significant number of service providers and customers during it&#x2019;s launch.",
      "Worked closely with the design and backend teams to ensure we put up something that would make the customers happy and create lasting value for the company.",
      "Performed software testing to uncover bugs and troubleshoot performance issues prior to application launch."
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "React Native Elements",
      "Expo",
      "Formik",
      "Socket.io"
    ]
  },
  "LUKSolar": {
    "position": "Frontend Engineer",
    "date": "Mar 2022 - Aug - 2022",
    "workDone": [
      "Led the development of a in-house sales management application for solar products which increased Solar Scout productivity by 30%, reduced administrative overhead by 20%, increased operational efficiency and generated more funding for the company.",
      "Worked closely with the design and backend teams to ensure we put up something that would make the users (Solar Scouts) happy and create lasting value for the company."
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "Native Base",
      "Expo",
      "Formik",
      "Socket.io"
    ]
  },
  "HackerBay": {
    "position": "Full-Stack Engineer",
    "date": "May 2020 - Oct - 2022",
    "workDone": [
      "Worked on a site reliability engineering tool. Developed and maintained — hands-on and fullstack — dozens of core features in Javascript, Node and React, across the entire platform.",
      "Refactored a React Native app and introduced Redux to provide a central store that holds all states of the application there by optimizing re-renders and preventing unnecessary rendering of components, leading to better application performance and scalability.",
      "I developed logic for stitching multiple images into a single image for upload without compromising the quality. Achieved 16x reduction in the upload time"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Redux Form",
      "Bootstrap",
      "Socket.io",
      "Node",
      "Express",
      "Puppeteer",
      "Mocha",
      "Chai",
      "Jest",
      "MongoDB",
      "OpenCV",
      "React Native",
      "Expo"
    ]
  },
  "Andela": {
    "position": "Full-Stack Engineer",
    "date": "Dec 2018 - Dec - 2019",
    "workDone": [
      "Developed and maintained major features of Andela&#x2019;s in-house, engineer placement process managing app.",
      "Worked on multiple Andela bootcamp projects enganging in the entire development lifecycle, right from requirements gathering and refining to implementation and deployment"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "SASS",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "Enzyme",
      "Python",
      "Flask",
      "Django",
      "Postgre SQL"
    ]
  },
  "GoPay": {
    "position": "Full-Stack Engineer",
    "date": "Aug 2017 - Oct - 2018",
    "workDone": [
      "Developed and maintained major features of Go Pay&#x2019;s management dashboard",
      "Implemented and tested the mobile money integration using the inter switch API. This improved the productivity of the backend team which was not family with the mobile money technology"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Bootstrap",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "MySQL"
    ]
  }
}
