{
  "Virtus": {
    "position": "Full-Stack Engineer",
    "date": "Mar 2023 - Present",
    "workDone": [
      "Implemented custom calendars for an in-house CRM, for scheduling service calls and assigning tasks to installers and supervisors, which improved operational efficiency.",
      "Redesigned a reporting module full-stack that was used to load multiple reports on a single page to a more efficient one that generates reports on demand improving loading time by over 60%.",
      "Implemented logic for uploading customer files on Google Cloud, which were being stored on a local hard drive. This significantly improved operational efficiency and employee productivity by 15%",
      "Introduced Redis caching on routes that were fetching a lot of data, this significantly improved the API response time by 80%",
      "I'm currently working on a property management tool that is used to manage construction work on apartment buildings",
      "Set up a CI/CD pipeline using CircleCI. This increased team productivity hence maximizing the overall ROI for the company.",
      "Participated in agile development processes, focusing on writing testable and maintainable code using test-driven development (TDD)."
    ],
    "technologies": [
      "JS",
      "TS",
      "React",
      "Redux",
      "Bootstrap",
      "Ant Design",
      "Formik",
      "Next",
      "Tailwind",
      "GCP",
      "Node",
      "Express",
      "Nest",
      "MongoDB",
      "Mocha",
      "Chai",
      "Jest",
      "React Testing Library",
      "Puppeteer",
      "Digital Ocean"
    ]
  },
  "Cognative": {
    "position": "Frontend Engineer",
    "date": "Sep 2022 - Feb - 2023",
    "workDone": [
      "I led the development of a construction services hailing application that registered a significant number of service providers and customers during its launch, which registered a 15% increase in the company revenew.",
      "Collaborated closely with the design and backend teams to ensure we put up something that would make the customers happy and create lasting value for the company.",
      "Created Github actions to build the app and upload final artifacts for publishing to the stores. This improved team productivity by 30%"
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "React Native Elements",
      "Expo",
      "Formik",
      "Socket.io"
    ]
  },
  "LUKSolar": {
    "position": "Frontend Engineer",
    "date": "Mar 2022 - Aug - 2022",
    "workDone": [
      "I led the development of an in-house sales management application for solar products which increased Solar Scout productivity by 30%, reduced administrative overhead by 20%, increased operational efficiency and generated more funding for the company.",
      "Worked closely with the design and backend teams to ensure we put up something that would make the users (Solar Scouts) happy and create lasting value for the company."
    ],
    "technologies": [
      "JS",
      "TS",
      "React Native",
      "Redux",
      "Redux Toolkit",
      "Native Base",
      "Expo",
      "Formik",
      "Socket.io"
    ]
  },
  "HackerBay": {
    "position": "Full-Stack Engineer",
    "date": "May 2020 - Oct - 2022",
    "workDone": [
      "Developed and maintained hands-on and full-stack, dozens of core features for a site reliability engineering tool using Javascript, Node and React.",
      "I refactored a React Native codebase to ensure a smooth integration of custom native modules specifically OpenCV and background processing, leading to better application performance and enhancing user experience.",
      "I reviewed a React Native code base to identify areas of improvement in both performance and security.",
      "I implemented logic for stitching multiple images into one for upload using OpenCV. Achieved a 25% reduction in the number of images required for upload, thus reducing the upload time and improving user experience",
      "I improved image upload functionality with background processing, greatly enhancing user experience"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Redux Form",
      "Bootstrap",
      "Socket.io",
      "Node",
      "Express",
      "Puppeteer",
      "Mocha",
      "Chai",
      "Jest",
      "MongoDB",
      "OpenCV",
      "React Native",
      "Expo"
    ]
  },
  "Andela": {
    "position": "Full-Stack Engineer",
    "date": "Dec 2018 - Dec - 2019",
    "workDone": [
      "Developed and maintained major features of Andela's in-house, engineer placement process managing app, improving productivity.",
      "Participated in different Andela bootcamp projects, engaging in the entire development lifecycle right from requirements gathering and refining to implementation and deployment"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "SASS",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "Enzyme",
      "Python",
      "Flask",
      "Django",
      "Postgre SQL"
    ]
  },
  "GoPay": {
    "position": "Full-Stack Engineer",
    "date": "Aug 2017 - Oct - 2018",
    "workDone": [
      "Developed and maintained major features of Go Pay's management dashboard",
      "Implemented and tested the mobile money integration using the inter-switch API. This improved the productivity of the backend team which was not familiar with the mobile money technology"
    ],
    "technologies": [
      "JS",
      "React",
      "Redux",
      "Bootstrap",
      "PHP",
      "Laravel",
      "PHP Unit",
      "Jest",
      "MySQL"
    ]
  }
}
